Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: Take the username Waveshare as an example
it_it: Prendiamo come esempio il nome utente Waveshare

source: Tangens
it_it: Tangente

source: Tangens hyperbolicus
it_it: Tangente iperbolica

source: Target Position: Enter the target position here, given in microsteps.
it_it: Target Position: Inserire qui la posizione di destinazione, espressa in microstep.

source: Target User
it_it: Utente Target

source: Technical Support
it_it: Supporto Tecnico

source: Test ADC header
it_it: Test header ADC

source: Test CAN header
it_it: Test header CAN

source: Test I2C header
it_it: Test header I2C

source: Test LVGL porting
it_it: Test porting LVGL

source: Test RGB screen
it_it: Test schermo RGB

source: Test RS485 header
it_it: Test header RS485

source: Test TF card slot
it_it: Test slot per scheda TF

source: Test UART porting
it_it: Test del porting UART

source: The #module directive has two parameters: the module index that is to be defined and the key of the module that is to be assigned to this module index.
it_it: La direttiva #module ha due parametri: l'indice del modulo da definire e la chiave del modulo da assegnare a questo indice.

source: The 4.3inch screen occupies the vast majority of the GPIO, and the development board uses the CH422G chip to expand the IO for resetting, turning off and on the backlight, etc.
it_it: Lo schermo da 4,3 pollici occupa la maggior parte del GPIO e la scheda di sviluppo utilizza il chip CH422G per espandere l'IO per il reset, lo spegnimento e l'accensione della retroilluminazione, ecc.

source: The Allow constant requests checkbox controls the regular polling of some other values like the actual voltage for the supply voltage display in the TMCL-IDE while the polling timer is running.
it_it: La checkbox Allow constant requests controlla il polling regolare di altri valori, come la tensione effettiva per la visualizzazione della tensione di alimentazione nell'IDE TMCL, mentre il timer di polling è in esecuzione.

source: The Board info tab provides some technical information about the module and its capabilities.
it_it: La scheda Board info fornisce alcune informazioni tecniche sul modulo e sulle sue capacità.

source: The Continue function continues the execution of a TMCL program that has been stopped using the Stop function from this menu.
it_it: La funzione Continue prosegue l'esecuzione di un programma TMCL interrotto tramite la funzione Stop da questo menù.

source: The Copy to TMCL Creator button copies the command to the TMCL Creator.
it_it: Il pulsante Copy to TMCL Creator copia il comando in TMCL Creator.

source: The DCF Generation tab page is used to generate DCF files.
it_it: Il tab DCF Generation viene utilizzata per generare file DCF.

source: The DCF Values tab contains an overview of all objects and their values that are to be stored in the DCF file or that have been loaded from the DCF file.
it_it: Il tab DCF Values contiene una panoramica di tutti gli oggetti e dei relativi valori che devono essere memorizzati nel file DCF o che sono stati caricati dal file DCF.

source: The Diagnostics section shows common diagnostic messages about the connected board.
it_it: La sezione Diagnostics mostra i messaggi di diagnostica più comuni relativi alla board collegata.

source: The Disassemble function reads out the TMCL memory of a module and disassembles its contents.
it_it: La funzione Disassemble legge la memoria TMCL di un modulo e ne disassembla il contenuto.

source: The EMCY tab contains a log of the CANopen emergency messages (EMCYs) produced by this device.
it_it: Il tab EMCY contiene un log dei messaggi di emergenza CANopen (EMCY) generati da questo dispositivo.

source: The Edit menu provides standard text editor functions like Undo, Redo, Cut, Copy, Paste and a Find/Replace function.
it_it: Il menù Edit fornisce funzioni standard dell'editor di testo come Undo, Redo, Cut, Copy, Paste e una funzione Find/Replace.

source: The File Info tab contains some information from the EDS file.
it_it: Il tab File Info contiene alcune informazioni dal file EDS.

source: The File menu of the TMCL Creator window provides the following functions:
it_it: Il menu File della finestra TMCL Creator offre le seguenti funzioni:

source: The General tab provides the name of the EDS file and NMT functions for this module:
it_it: Il tab General fornisce il nome del file EDS e le funzioni NMT per questo modulo:

source: The Load from device button reloads all PDO definitions from the device.
it_it: Il pulsante Load from device ricarica tutte le definizioni PDO dal dispositivo.

source: The Stop function stops a TMCL program that is running on the module.
it_it: La funzione Stop arresta un programma TMCL in esecuzione sul modulo.

source: The TMCL Log checkbox generally switches on or off the history display for this module.
it_it: La checkbox TMCL Log generalmente attiva o disattiva la visualizzazione della cronologia per questo modulo.

source: The TMCL Log checkbox generally switches on or off the history display for this port.
it_it: La checkbox TMCL Log in genere attiva o disattiva la visualizzazione della cronologia per questa porta.

source: The TMCL/PC menu provides functions for assembling and executing TMCL programs as well as for setting some options of the TMCL/PC Host.
it_it: Il menù TMCL/PC fornisce funzioni per l'assemblaggio e l'esecuzione di programmi TMCL, nonché per l'impostazione di alcune opzioni dell'host TMCL/PC.

source: The TMCL menu provides functions for assembling and downloading TMCL programs as well as for setting some options of the TMCL Creator.
it_it: Il menù TMCL fornisce funzioni per l'assemblaggio e il download di programmi TMCL, nonché per l'impostazione di alcune opzioni di TMCL Creator.

source: The loop function reads the current AD value every 100ms and prints the current AD value.
it_it: La funzione loop legge il valore AD corrente ogni 100 ms e lo stampa.

source: The setup function first initializes the serial communication, then initializes the ADC, and sets the ADC resolution to 12 bits (0-4096).
it_it: La funzione setup inizializza prima la comunicazione seriale, poi inizializza l'ADC e imposta la risoluzione dell'ADC a 12 bit (0-4096).

source: The Settings function opens a dialog where the text colors can be customized.
it_it: La funzione Settings apre una finestra di dialogo in cui è possibile personalizzare i colori del testo.

source: The Access column shows if a parameter is readable and/or writable using the following letters:
it_it: La colonna Access indica se un parametro è leggibile e/o scrivibile utilizzando le seguenti lettere:

source: The DCF Value column shows the value that is used in the DCF file.
it_it: La colonna DCF Value mostra il valore utilizzato nel file DCF.

source: The Emergency Stop button stops all the TMCL program execution on the module and also stops all motors connected to the module.
it_it: Il pulsante Emergency Stop interrompe l'esecuzione di tutti i programmi TMCL sul modulo e arresta anche tutti i motori ad esso collegati.

source: The Remove button can be used to remove a local variable from the watch list.
it_it: Il pulsante Remove è utilizzabile per rimuovere una variabile locale dall'elenco dei controlli.

source: The Clear all button clears the entire list of watches.
it_it: Il pulsante Clear all cancella l'intero elenco degli oggetti sotto esame.

source: The Animate Function
it_it: La Funzione Animate

source: The Arduino IDE board manager is used to record the configuration information of the development board and the tool chain used in the development process, refer to this tutorial to install the ESP32 board.
it_it: Il gestore di schede *Arduino IDE* viene utilizzato per registrare le informazioni di configurazione della scheda di sviluppo e la tool chain utilizzata nel processo di sviluppo. Per installare la scheda ESP32, fare riferimento a questo tutorial.

source: The Axis Parameter Display
it_it: Visualizzazione dei Parametri degli Assi

source: The Axis Parameter Display is a tool for displaying the values of selected axis parameters with automatic periodic update.
it_it: "Axis Parameter Display" è un tool per visualizzare i valori dei parametri degli assi selezionati con aggiornamento periodico automatico.

source: The BLDC Settings tool provides functions for configuring a BLDC motor control module for use with a specific motor.
it_it: Il tool BLDC Settings fornisce funzioni per configurare un modulo di controllo di motore BLDC da utilizzare con un motore specifico.

source: The CAN and RS485 peripherals use jumpers to connect the 120 ohm resistor by default, and NC is optional to cancel terminal resistor connection
it_it: Le periferiche CAN e RS485 utilizzano jumper per collegare la resistenza da 120 ohm di default, mentre NC è opzionale per annullare la connessione della resistenza terminale.

source: The CH422G and touch of the board occupy the following slave address, please do not use I2C devices with the same address:
it_it: Il CH422G e il touch della scheda occupano il seguente indirizzo slave; non utilizzare dispositivi I2C con lo stesso indirizzo:

source: The Chip-Click Tool
it_it: Il Tool Chip-Click

source: The Chip-Click Tool is provided to set the states of those pins.
it_it: Il Il Tool Chip-Click è fornito per impostare lo stato di questi pin.

source: The Chip-Click Tool shows all these pins on the footprint of the chip (as shown in the chip datasheet).
it_it: Il Tool Chip-Click mostra tutti questi pin sul footprint del chip (come mostrato nel datasheet del chip).

source: The Chopper Settings
it_it: Il Chopper Settings

source: The Chopper Settings tool is provided for all modules that also support the StealthChop mode.
it_it: Il tool Chopper Settings è disponibile per tutti i moduli che supportano anche la modalità StealthChop.

source: The Closed Loop Tool
it_it: Il Tool Closed Loop

source: The CoolStep & StallGuard2 Tool
it_it: Il Tool CoolStep & StallGuard2

source: The CoolStep & StallGuard2 tool is provided for modules that are equipped with the CoolStep and the StallGuard2 feature.
it_it: Il tool "CoolStep e StallGuard2" è disponibile per i moduli dotati delle funzionalità CoolStep e StallGuard2.

source: The CoolStep & StallGuard2 tool provides an interactive way for adjusting the necessary settings.
it_it: Il tool CoolStep & StallGuard2 offre un modo interattivo per regolare le impostazioni necessarie.

source: The CoolStep Tab
it_it: Il Tab CoolStep

source: The CoolStep tab represents all settings that are necessary for using the CoolStep feature.
it_it: Il tab CoolStep rappresenta tutte le impostazioni necessarie per l'utilizzo della funzione CoolStep.

source: The DCF flag and the DCF value can also be changed here before saving the DCF file or before configuring the device.
it_it: Il flag DCF e il valore DCF possono essere modificati anche qui prima di salvare il file DCF o prima di configurare il dispositivo.

source: The DLL file should be placed in the directory where the demo program is located, there are two DLL files stored in the sample file (corresponding to 64-bit system and 32-bit system respectively), please adjust according to the system.
it_it: Il file DLL deve essere posizionato nella directory in cui si trova il programma demo. Nel file di esempio sono memorizzati due file DLL (corrispondenti rispettivamente a un sistema a 64 bit e a un sistema a 32 bit); si prega di adattarli in base al sistema.

source: The Datagram Mode
it_it: Il Datagram Mode

source: The Datagram Mode is provided for all chips that are equipped with an SPI interface.
it_it: Il Datagram Mode è disponibile per tutti i chip dotati di interfaccia SPI.

source: The Debugger
it_it: Il Debugger

source: The Direct Mode
it_it: La Modalità Diretta

source: The Direct Mode window will then be extended as can be seen in figure 13.
it_it: La finestra "Direct Mode" verrà quindi estesa, come mostrato nella figura 13.

source: The EDS files for all Trinamic CANopen modules are already integrated into the TMCL-IDE, so one does not have to care about this.
it_it: I file EDS per tutti i moduli CANopen Trinamic sono già integrati in TMCL-IDE, quindi non è necessario preoccuparsene.

source: The ESP32-S3-Touch-LCD-4.3 can identify the type and size of an TF card, and then perform file operations such as adding, deleting, modifying, and querying.
it_it: L'ESP32-S3-Touch-LCD-4.3 è in grado di identificare il tipo e la dimensione di una scheda TF, per poi eseguire operazioni sui file quali aggiunta, eliminazione, modifica e query.

source: The ESP32-S3-Touch-LCD-4.3 development board comes with an offline package.
it_it: La scheda di sviluppo ESP32-S3-Touch-LCD-4.3 viene fornita con un pacchetto offline.

source: The Edit Menu
it_it: Il Menù Edit

source: The Expert Mode tool can be used to directly access CANopen objects on a device, without needing the information contained in the EDS file.
it_it: Il tool Expert Mode è utilizzabile per accedere direttamente agli oggetti CANopen su un dispositivo, senza dover utilizzare le informazioni contenute nel file EDS.

source: The File Menu
it_it: Il Menù File

source: The Firmware Update Tool
it_it: Il Firmware Update Tool

source: The Firmware Update Tool provides the functionality for updating the firmware of TRINAMIC motor control modules and evaluation boards.
it_it: Il Firmware Update Tool fornisce la funzionalità per aggiornare il firmware dei moduli di controllo motore e delle evaluation board TRINAMIC.

source: The Flags Tool (BLDC Motor)
it_it: Il Tool Flags (BLDC Motor)

source: The Flags View
it_it: La "Flags View"

source: The Global Parameters Tool
it_it: Il Tool dei Parametri Globali

source: The High Speed Tab
it_it: Il Tab High Speed

source: The I2C and SPI examples is in "../USB-TO-UART-I2C-SPI-JTAG-Demo/Windows/Code"
it_it: Gli esempi I2C e SPI si trovano in "../USB-TO-UART-I2C-SPI-JTAG-Demo/Windows/Code"

source: The INI file can be used to download the parameters later, using this tool.
it_it: Il file INI può essere utilizzato per scaricare i parametri in un secondo momento, utilizzando questo strumento.

source: The Import/Export Tool
it_it: Il Tool Import/Export

source: The Import/Export Tool provides the following functions:
it_it: Il Tool Import/Export offre le seguenti funzioni:

source: The Import/Export tool is a utility for reading out all important settings from a module and generating TMCL source code from it.
it_it: Il tool Import/Export è un'utilità per leggere tutte le impostazioni importanti da un modulo e generare da esso il codice sorgente TMCL.

source: The Import/Export tool is an easier way of generating and using DCF files (according to the CiA-305 standard) for exporting and importing the configuration of a CANopen device.
it_it: Il tool Import/Export è un modo più semplice per generare e utilizzare file DCF (secondo lo standard CiA-305) per esportare e importare la configurazione di un dispositivo CANopen.

source: The LSS bitrate activation delay will be used.
it_it: Verrà utilizzato il ritardo di attivazione del bitrate LSS.

source: The LSS tab provides support for the CANopen Layer Setting Service (LSS).
it_it: Il tab LSS fornisce supporto per il servizio CANopen Layer Setting Service (LSS).

source: The Local Variables Window
it_it: La Finestra delle Variabili locali

source: The Local Variables Window provides functions for inspecting and changing the contents of the TMCL/PC local variables.
it_it: La "Local Variables Window" fornisce funzioni per ispezionare e modificare il contenuto delle variabili locali TMCL/PC.

source: The Main Evaluation Board Tool
it_it: Il Tool Principale della Evaluation Board

source: The Main Module Tool
it_it: Strumento del Modulo Principale

source: The Module Assignments dialog helps defining these assignments as it is capable of generating these commands.
it_it: La dialog "Module Assignments" aiuta a definire queste assegnazioni, poiché è in grado di generare questi comandi.

source: The Object Browser
it_it: L'Object Browser

source: The PDO Configurator is a tool for easily changing all PDO definitions of a device.
it_it: Il PDO Configurator è uno strumento che consente di modificare facilmente tutte le definizioni PDO di un dispositivo.

source: The PDO Receiver tool displays the contents of PDOs sent out by the device (TPDOs).
it_it: Il tool PDO Receiver visualizza il contenuto dei PDO inviati dal dispositivo (TPDO).

source: The PDO contents are shown with the object index (hexadecimal), the object sub-index (decimal) and the contents of that object.
it_it: Il contenuto dei PDO viene visualizzato con l'indice dell'oggetto (esadecimale), il sottoindice dell'oggetto (decimale) e il contenuto di tale oggetto.

source: The PDO entry context menu offers the following functions:
it_it: Il menù PDO entry context offre le seguenti funzioni:

source: The PI tuning tool for position can be seen in the figure below.
it_it: Lo strumento di regolazione PI per la posizione è visibile nella figura seguente.

source: The PI tuning tool for torque can be seen in the figure 53.
it_it: Lo strumento di regolazione PI per la coppia è visibile nella figura 53.

source: The PI tuning tool is used for this purpose.
it_it: A questo scopo viene utilizzato il tool di ottimizzazione PI.

source: The Parameter Browser
it_it: Il Parameter Browser

source: The Parameter Browser is quite similar to the Parameter Display tool.
it_it: Il Parameter Browser è molto simile al tool Parameter Display.

source: The Parameter Calculator
it_it: Calcolatore di Parametri

source: The Parameter Calculator can convert from pps units to the other units as well as from other units back to pps units.
it_it: Il "Parameter Calculator" può convertire da unità pps ad altre unità e viceversa.

source: The Parameter Calculator for TMC429 based stepper motor modules helps to convert between physical units for velocity and acceleration and the internal units used by those modules that are based on the TMC429 motion controller.
it_it: Il "Parameter Calculator" per i moduli motore passo-passo basati su TMC429 aiuta a convertire le unità fisiche di velocità e accelerazione in unità interne utilizzate dai moduli basati sul motion controller TMC429.

source: The Parameter Calculator for stepper motor modules that use pps units just converts between pulses per second and units like rounds per minute or rounds per second.
it_it: Il "Parameter Calculator" per i moduli motore passo-passo che utilizzano unità pps converte semplicemente tra impulsi al secondo e unità come giri al minuto o giri al secondo.

source: The Parameter Calculator is a utility for converting between different units of motion parameters like the velocity and the acceleration.
it_it: Il "Parameter Calculator" è un'utilità per la conversione tra diverse unità di misura di parametri di movimento come velocità e accelerazione.

source: The Parameter Display
it_it: Il Parameter Display

source: The Parameter Display is a tool for displaying the contents of selected TMCL axis parameters and user variables with automatic periodic update.
it_it: Parameter Display è un tool per visualizzare il contenuto dei parametri degli assi TMCL selezionati e delle variabili utente con aggiornamento periodico automatico.

source: The Parameter Display tool is the same tool as the TMCL Parameter Display.
it_it: Il tool Parameter Display è lo stesso tool TMCL Parameter Display.

source: The Pause Function
it_it: La Funzione Pause

source: The Position Graph
it_it: Il Position Graph

source: The Position Graph is a tool for graphically displaying axis parameters.
it_it: Il Position Graph è un tool per la visualizzazione grafica dei parametri degli assi.

source: The Position Graph tool is the same tool as the TMCL Position Graph.
it_it: Il tool Position Graph è lo stesso del TMCL Position Graph.

source: The Position Mode
it_it: Il Position Mode

source: The Register Browser
it_it: Il Browser dei Registri

source: The Result of the StallGuard Profiler
it_it: Il Risultato del Profiler StallGuard

source: The Run/Continue Function
it_it: La Funzione Run/Continue

source: The Settings Tool (BLDC Motor)
it_it: Il Tool Settings (Motore BLDC)

source: The Settings Tool (Stepper Motor)
it_it: Il Tool Settings (Motore Stepper)

source: The Settings tool allows changing basic axis-specific settings.
it_it: Il tool Settings consente di modificare le impostazioni di base specifiche per ciascun asse.

source: The SpreadCycle Tab
it_it: Il Tab SpreadCycle

source: The StallGuard Adjuster
it_it: Il Regolatore StallGuard

source: The StallGuard Profiler
it_it: Il Profiler StallGuard

source: The StallGuard adjusting tool is provided for modules that are equipped with the StallGuard (not the Stall-Guard2) feature.
it_it: Il tool di regolazione StallGuard è fornito per i moduli dotati della funzione StallGuard (non Stall-Guard2).

source: The StallGuard profiler tool is provided for modules that are equipped with the StallGuard (not the Stall-Guard2) feature.
it_it: Il tool profiler StallGuard è disponibile per i moduli dotati della funzionalità StallGuard (non Stall-Guard2).

source: The StallGuard2 Tab
it_it: Il Tab StallGuard2

source: The StallGuard2 feature does not work the same with all velocities.
it_it: La funzione StallGuard2 non funziona allo stesso modo con tutte le velocità.

source: The StallGuard2 tab contains the following parameters:
it_it: Il tab StallGuard2 contiene i seguenti parametri:

source: The StealthChop Tab
it_it: Il Tab StealthChop

source: The Step Function
it_it: La Funzione Step

source: The Stop & Reset Function
it_it: La Funzione Stop & Reset

source: The TF card uses SPI/MMC to communicate, note that the SD_CS pin needs to be driven by the EXIO4 of the CH422G
it_it: La scheda TF utilizza SPI/MMC per comunicare; si noti che il pin SD_CS deve essere pilotato dall'EXIO4 del CH422G.

source: The TMCL Creator
it_it: Il TMCL Creator

source: The TMCL Menu
it_it: Il Menù TMCL

source: The TMCL Tab
it_it: Il Tab TMCL

source: The TMCL program editor mainly provides the functionality of a standard text editor with built-in syntax highlighting for TMCL.
it_it: L'editor di programmi TMCL offre principalmente le funzionalità di un editor di testo standard con evidenziazione della sintassi integrata per TMCL.

source: The TMCL tab shows all adjustments which have been made on the other tabs of the CoolStep & Stall-Guard2 tool as TMCL commands.
it_it: Il tab TMCL mostra tutte le regolazioni effettuate nelle altre schede del tool CoolStep e Stall-Guard2 come comandi TMCL.

source: The TMCL-IDE 2.x can be downloaded as "Legacy IDE" from the TRINAMIC website.
it_it: TMCL-IDE 2.x può essere scaricato come "Legacy IDE" dal sito web TRINAMIC.

source: The TMCL-IDE also provides tools that guide the user step by step through some more complex functions and setup processes of a module or a chip evaluation board.
it_it: TMCL-IDE fornisce anche strumenti che guidano l'utente passo dopo passo attraverso alcune funzioni più complesse e processi di configurazione di un modulo o di una scheda di valutazione di chip.

source: The TMCL-IDE can also connect to modules through these types of serial interfaces.
it_it: TMCL-IDE può connettersi ai moduli anche tramite questi tipi di interfacce seriali.

source: The TMCL-IDE can be downloaded free of charge from software section of the ADI website:
it_it: TMCL-IDE può essere scaricato gratuitamente dalla sezione software del sito web ADI:

source: The TMCL-IDE is an integrated development environment made for developing applications that use Trinamic modules and chips.
it_it: TMCL-IDE è un ambiente di sviluppo integrato pensato per lo sviluppo di applicazioni che utilizzano moduli e chip Trinamic.
